import instance from "./db.js";

const boards = [
	"सर्व",
	"चर्चा",       // General
	"समाचार",     // News
	"राजनीति",    // Politics
	"मनोरंजन",    // Entertainment
	"खेल",        // Gaming
	"प्रौद्योगिकी", // Technology
	"शिक्षा",      // Education
	"व्यापार",     // Business
	"भोजन",       // Food
	"आरोग्य",     // Health & Fitness
	"वाहन",       // Vehicles
	"यात्रा"       // Travel
];

const boardsExtra =  [
	// ["सर्व", "हर विषय की चर्चा, समाचार और विचार एक ही स्थान पर।"],
	["चर्चा", "विचार साझा करें, प्रश्न पूछें और सार्थक संवाद करें।"],
	["समाचार", "देश-दुनिया की ताज़ा और महत्वपूर्ण खबरें।"],
	["राजनीति", "शासन, नीतियाँ, चुनाव और जनजीवन से जुड़े विषय।"],
	["मनोरंजन", "फ़िल्म, संगीत, कला, हास्य और मनोरंजन की दुनिया।"],
	["खेल", "खेलकूद, वीडियो खेल, प्रतियोगिताएँ और खिलाड़ियों की चर्चा।"],
	["प्रौद्योगिकी", "नई तकनीक, उपकरण, सॉफ़्टवेयर और नवाचार।"],
	["शिक्षा", "अध्ययन, परीक्षाएँ, करियर और ज्ञानवर्धक सामग्री।"],
	["व्यापार", "व्यवसाय, बाज़ार, निवेश और आर्थिक गतिविधियाँ।"],
	["भोजन", "व्यंजन, पाककला, स्वाद और भोजन संबंधी अनुभव।"],
	["आरोग्य", "स्वास्थ्य, व्यायाम, पोषण और स्वस्थ जीवनशैली।"],
	["वाहन", "चारचक्री, द्विचक्री और परिवहन संबंधी जानकारी।"],
	["यात्रा", "भ्रमण, पर्यटन, गंतव्य और यात्रा के अनुभव।"],
];


const stmt = instance.db.prepare(
  "INSERT OR IGNORE INTO boards (name, description) VALUES (?, ?);"
);

for (const [board, description] of boardsExtra) {
  stmt.run(board, description)
}